{
    "intents": [
        {
            "tag": "covid_symptoms",
            "patterns": ["What are COVID symptoms?", "Do I have COVID?", "Tell me about coronavirus symptoms"],
            "responses": ["Common COVID-19 symptoms include fever, cough, and difficulty breathing."]
        },
        {
            "tag": "fever_treatment",
            "patterns": ["How to reduce fever?", "What should I do for a fever?", "Home remedies for fever?"],
            "responses": ["Drink fluids, rest, and take paracetamol if needed. If the fever is high, consult a doctor."]
        },
        {
            "tag": "headache",
            "patterns": ["I have a headache", "What causes headaches?", "How to cure headaches?"],
            "responses": ["Common causes include stress, dehydration, and lack of sleep. Rest and drink water."]
        },
        {
            "tag": "cough_treatment",
            "patterns": ["How to treat a cough?", "I have a cough, what should I do?", "What helps for a persistent cough?"],
            "responses": ["Drink warm fluids, try honey and ginger, and consult a doctor if the cough persists for more than a week."]
        },
        {
            "tag": "cold_symptoms",
            "patterns": ["What are the symptoms of a cold?", "Do I have a cold?", "What should I do if I have a cold?"],
            "responses": ["Common cold symptoms include a runny nose, sore throat, and sneezing. Rest and drink plenty of fluids."]
        },
        {
            "tag": "flu_treatment",
            "patterns": ["How to treat the flu?", "What should I do for flu?", "How long does the flu last?"],
            "responses": ["Get plenty of rest, drink fluids, and take over-the-counter medications like ibuprofen. Consult a doctor if symptoms worsen."]
        },
        {
            "tag": "sore_throat",
            "patterns": ["How to treat a sore throat?", "What causes a sore throat?", "What can I do for a sore throat?"],
            "responses": ["Gargle with warm salt water, stay hydrated, and try throat lozenges or honey to soothe the pain."]
        },
        {
            "tag": "allergy",
            "patterns": ["What causes allergies?", "How to treat allergies?", "What are common allergens?"],
            "responses": ["Allergies can be caused by pollen, dust, or food. Over-the-counter antihistamines can help relieve symptoms."]
        },
        {
            "tag": "chest_pain",
            "patterns": ["I have chest pain", "What does chest pain mean?", "How serious is chest pain?"],
            "responses": ["Chest pain can be caused by several things, including heart problems. Seek medical attention immediately if the pain is severe."]
        },
        {
            "tag": "back_pain",
            "patterns": ["How to relieve back pain?", "What causes back pain?", "I have lower back pain, what should I do?"],
            "responses": ["Try gentle stretching, using a heat pad, and taking over-the-counter pain relief. Consult a doctor if pain persists."]
        },
        {
            "tag": "stomach_ache",
            "patterns": ["I have a stomach ache", "What causes stomach pain?", "How to cure stomach ache?"],
            "responses": ["Stomach pain can be caused by indigestion, stress, or infections. Drink ginger tea and avoid heavy meals."]
        },
        {
            "tag": "high_blood_pressure",
            "patterns": ["What is high blood pressure?", "How to lower blood pressure?", "What causes high blood pressure?"],
            "responses": ["High blood pressure can be caused by stress, obesity, and a high-sodium diet. Regular exercise, healthy diet, and medication can help."]
        },
        {
            "tag": "low_blood_pressure",
            "patterns": ["What is low blood pressure?", "How to raise blood pressure?", "What causes low blood pressure?"],
            "responses": ["Low blood pressure can be caused by dehydration, blood loss, or heart problems. Drinking fluids and eating small, frequent meals can help."]
        },
        {
            "tag": "diabetes",
            "patterns": ["What is diabetes?", "How to control diabetes?", "What are the symptoms of diabetes?"],
            "responses": ["Diabetes is a condition where the body can't produce or respond to insulin. A healthy diet, regular exercise, and medication are key to managing it."]
        },
        {
            "tag": "insulin",
            "patterns": ["What is insulin?", "How does insulin work?", "Why do diabetics need insulin?"],
            "responses": ["Insulin is a hormone that helps regulate blood sugar levels. People with diabetes often need insulin to help manage their condition."]
        },
        {
            "tag": "pregnancy_symptoms",
            "patterns": ["What are the symptoms of pregnancy?", "How do I know if I'm pregnant?", "What are early pregnancy signs?"],
            "responses": ["Common pregnancy symptoms include missed periods, nausea, and fatigue. Take a home pregnancy test and consult your doctor for confirmation."]
        },
        {
            "tag": "morning_sickness",
            "patterns": ["What is morning sickness?", "How to treat morning sickness?", "What causes morning sickness?"],
            "responses": ["Morning sickness is nausea that occurs in the early stages of pregnancy. Eating small meals, staying hydrated, and resting can help alleviate it."]
        },
        {
            "tag": "heart_attack",
            "patterns": ["What are the signs of a heart attack?", "How do I know if I'm having a heart attack?", "What should I do during a heart attack?"],
            "responses": ["Signs include chest pain, shortness of breath, and dizziness. Seek immediate medical help if you suspect a heart attack."]
        },
        {
            "tag": "stroke",
            "patterns": ["What are the symptoms of a stroke?", "How do I know if I had a stroke?", "What should I do if I think I had a stroke?"],
            "responses": ["Signs include sudden numbness, confusion, and difficulty speaking. Seek emergency medical attention immediately."]
        },
        {
            "tag": "cancer_symptoms",
            "patterns": ["What are the symptoms of cancer?", "How do I know if I have cancer?", "What are early signs of cancer?"],
            "responses": ["Cancer symptoms vary but may include unexplained weight loss, lumps, and changes in bowel or bladder habits. Consult your doctor for screening."]
        },
        {
            "tag": "anxiety",
            "patterns": ["What is anxiety?", "How to treat anxiety?", "What causes anxiety?"],
            "responses": ["Anxiety is often caused by stress, genetics, or chemical imbalances. Therapy, mindfulness, and medications can help manage it."]
        },
        {
            "tag": "depression",
            "patterns": ["What is depression?", "How to treat depression?", "What causes depression?"],
            "responses": ["Depression can be caused by life events, genetics, or chemical imbalances. Therapy and medication are effective treatments."]
        },
        {
            "tag": "sleep_disorders",
            "patterns": ["What causes sleep disorders?", "How to treat insomnia?", "How to sleep better?"],
            "responses": ["Sleep disorders can be caused by stress, anxiety, or medical conditions. Good sleep hygiene and relaxation techniques can help."]
        },
        {
            "tag": "arthritis",
            "patterns": ["What causes arthritis?", "How to treat arthritis?", "What is arthritis?"],
            "responses": ["Arthritis is an inflammation of the joints. Pain relievers, physical therapy, and lifestyle changes can help manage it."]
        },
        {
            "tag": "asthma",
            "patterns": ["What is asthma?", "How to treat asthma?", "What causes asthma?"],
            "responses": ["Asthma is a condition where the airways constrict, causing difficulty breathing. Inhalers and medication can help manage symptoms."]
        },
        {
            "tag": "cholesterol",
            "patterns": ["What is cholesterol?", "How to lower cholesterol?", "What causes high cholesterol?"],
            "responses": ["Cholesterol is a fatty substance in the blood. A healthy diet, exercise, and medications can help lower cholesterol levels."]
        },
        {
            "tag": "blood_test",
            "patterns": ["What is a blood test?", "What does a blood test show?", "Why do I need a blood test?"],
            "responses": ["A blood test checks for various markers like cholesterol, glucose, and organ function. It's essential for diagnosing many conditions."]
        },
        {
            "tag": "immunization",
            "patterns": ["What is immunization?", "What vaccines do I need?", "Why is immunization important?"],
            "responses": ["Immunization helps protect against infectious diseases. Common vaccines include those for flu, measles, and polio."]
        },
        {
            "tag": "weight_loss",
            "patterns": ["How to lose weight?", "What are some weight loss tips?", "How can I burn fat?"],
            "responses": ["Weight loss requires a balanced diet, exercise, and healthy habits. Consult a nutritionist for personalized advice."]
        },
        {
            "tag": "nutrition",
            "patterns": ["What is good nutrition?", "How to improve nutrition?", "What should I eat to stay healthy?"],
            "responses": ["Good nutrition includes a balanced diet with fruits, vegetables, proteins, and whole grains. Avoid processed foods."]
        },
        {
            "tag": "exercise",
            "patterns": ["How much exercise do I need?", "What type of exercise is best?", "How to start exercising?"],
            "responses": ["Aim for at least 30 minutes of moderate exercise most days. Start with walking or light cardio, and gradually increase intensity."]
        },
        {
            "tag": "skin_care",
            "patterns": ["How to take care of my skin?", "What are the best skincare tips?", "How to prevent acne?"],
            "responses": ["Use sunscreen daily, stay hydrated, and cleanse your skin twice a day. For acne, consider using products with salicylic acid."]
        },
        {
            "tag": "eye_health",
            "patterns": ["How to improve eye health?", "What are common eye problems?", "How to prevent eye strain?"],
            "responses": ["Rest your eyes regularly, wear sunglasses, and have regular eye checkups. A balanced diet with vitamin A also supports eye health."]
        },
        {
            "tag": "dental_health",
            "patterns": ["How to keep my teeth healthy?", "What should I do for tooth pain?", "How often should I brush my teeth?"],
            "responses": ["Brush twice a day, floss regularly, and visit the dentist every 6 months. For tooth pain, consult a dentist."]
        }
    ]
}
